app/Models/ModelProduk.php

    public function AllData()
    {
        return $this->db->table('tbl_produk')->get()->getResultArray();
---
SELECT *
FROM `tbl_produk`