app/Models/ModelKategori.php

    public function InsertData($data)
    {
    $this->db->table('tbl_kategori')->insert($data);
---
INSERT INTO `tbl_kategori` (`nama_kategori`) VALUES ('Produk Hukum')

    public function DeleteData($data)
    {
        $this->db->table('tbl_kategori')
        ->where('id_kategori',$data['id_kategori'])
        ->delete($data);
---
DELETE FROM `tbl_kategori`
WHERE `id_kategori` = '3'
AND `id_kategori` = '3'