app/Models/ModelUser.php

    public function AllData()
    {
        return $this->db->table('tbl_user')
        ->join('tbl_bagian','tbl_bagian.id_bagian = tbl_user.id_bagian', 'left')
        ->orderBy('id_user','DESC')
        ->get()->getResultArray();
---
SELECT *
FROM `tbl_user`
LEFT JOIN `tbl_bagian` ON `tbl_bagian`.`id_bagian` = `tbl_user`.`id_bagian`
ORDER BY `id_user` DESC