app/Models/ModelBagian.php

    public function AllData()
    {
        return $this->db->table('tbl_bagian')->get()->getResultArray();
---
SELECT *
FROM `tbl_bagian`